[
    {
        "id": 1,
        "cover": "https://i.ibb.co/84Zfw2n/1.jpg",
        "title": "Top 10 ES6 Features You Must Know",
        "description": "we will explore the essential ES6 features that every developer should be familiar with. These features enhance code readability, maintainability, and overall productivity, making ES6 a must-know for modern web developers.",
        "author_img": "https://i.ibb.co/VvLNdLL/boy1.png",
        "author": "Hamza Sohail",
        "posted_date": "September 15, 2023",
        "reading_time": 5,
        "hashtags": [
            "beginners",
            "es6"
        ]
    },
    {
        "id": 2,
        "cover": "https://i.ibb.co/6N2dgnZ/2.png",
        "title": "JavaScript Objects for Absolute Beginners: A Fun Introduction",
        "description": "JavaScript has evolved significantly over the years. With the introduction of ECMAScript 6 (ES6), developers gained access to a host of new features and improvements that have transformed the way JavaScript code is written and maintained.",
        "author_img": "https://i.ibb.co/7rFSJx5/girl1.jpg",
        "author": "Sajal Ali",
        "posted_date": "August 28, 2023",
        "reading_time": 4,
        "hashtags": [
            "javascript",
            "coding",
            "dev"
        ]
    },
    {
        "id": 3,
        "cover": "https://i.ibb.co/RzGzcPg/3.png",
        "title": "Component lifecycle in React — Class component vs Functional component",
        "description": " Class components provide lifecycle methods like componentDidMount, componentDidUpdate, and componentWillUnmount. Functional components achieve similar functionality using the useEffect hook, which can handle side effects and lifecycle events in a unified API",
        "author_img": "https://i.ibb.co/vwGwnhT/boy2.jpg",
        "author": "Feroze Khan",
        "posted_date": "July 10, 2023",
        "reading_time": 10,
        "hashtags": [
            "mid_level",
            "react"
        ]
    },
    {
        "id": 4,
        "cover": "https://i.ibb.co/vvTfkcv/4.jpg",
        "title": "Free images and resources collection for website",
        "description": "If you desire to have a website background that showcases the ripples of a river through SVG or blob, wave, gradients, low poly, or gradient effects, and customise it according to your preferences, then waste no time and head straight to this link. Take the reins and generate a background with river-like patterns that perfectly align with your own vision.",
        "author_img": "https://i.ibb.co/Sn7zB4q/girl2.jpg",
        "author": "Anmol Baloch",
        "posted_date": "June 5, 2023",
        "reading_time": 9,
        "hashtags": [
            "development",
            "resources"
        ]
    }
]